Revit 2024 API
DataTransferMode Enumeration
 Describes the data transfer mode.
 Describes the data transfer mode.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public enum DataTransferMode
Visual Basic
Public Enumeration DataTransferMode
Visual C++
public enum class DataTransferMode
Members
Member name | Description
Undefined |  Undefined mode.
Download |  Transfer data from server to client.
Upload |  Transfer data from client to server.
See Also
Autodesk.Revit.DB.Events Namespace